import time
the_date = time.strftime("%d.%m.%Y")
the_time = time.strftime("%H:%M")


SB, OB, AB, MB = 620527199, 909076309, 1032986559, 632117641
FAM = [SB, OB, AB, MB]
num = ['+','-','0','1','2','3','4','5','6','7','8','9']
chat = -892903165
na = 'Вибачте, але ви не маєте доступу!'
dostavka = 'Доставка здійснюється щовівторка.'
text_fire = 'Доброго дня!\nЗавтра ми здійснюємо доставку води Аляска та ' \
                'Моршинська, перегляньте залишки і в разі потреби – ви можете ' \
                'зробити замовлення у цьому чат-боті.\nБережіть себе та своїх близьких!'
